Revit 2026 API

# MEPAnalyticalModelData Class

---

Represents the MEP analytical model data attached to individual element.

SystemObject Autodesk.Revit.DB.AnalysisMEPAnalyticalModelData

**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class MEPAnalyticalModelData : IDisposable
```
```vb
Public Class MEPAnalyticalModelData
	Implements IDisposable
```
```cpp
public ref class MEPAnalyticalModelData : IDisposable
```
```fsharp
type MEPAnalyticalModelData =
    class
        interface IDisposable
    end
```

The MEPAnalyticalModelData type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the MEPAnalyticalModelData |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetMEPAnalyticalModelData | Gets the MEP analytical model data of the specified element. |
|  | GetNodeById | Gets the analytical node with the specified id. |
|  | GetNodeByIndex | Gets the specified analytical node. |
|  | GetNumberOfNodes | Returns the number of analytical nodes. |
|  | GetNumberOfSegments | Returns the number of analytical segments. |
|  | GetSegmentById | Gets the analytical segment with the specified id. |
|  | GetSegmentByIndex | Gets the analytical segment at the specified position. |
|  | GetSegmentData | Gets the analysis data on the specified segment. |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | IsValidNodeId | Verifies if a valid analytical node id. |
|  | IsValidSegmentId | Verifies if a valid segment id. |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

The MEP analytical model is composed of generic analytical segments and nodes. Each Revit element may have one or more analytical segments. Connected together, these data form a network that is used in the flow and pressure drop calculation.

#### Reference

Autodesk.Revit.DB.Analysis Namespace